app/controllers/residences_controller.rb

SELECT "residences".* FROM "residences"
---
    def index
        if params[:country]
            if @residences = Residence.where('country ILIKE ?', "%#{params[:country]}%").count > 0
                @residences = Residence.where('country ILIKE ?', "%#{params[:country]}%")
            else
                if @residences = Residence.where('name ILIKE ?', "%#{params[:country]}%").count > 0
                    @residences = Residence.where('name ILIKE ?', "%#{params[:country]}%")
                else
                    if @residences = Residence.where('description ILIKE ?', "%#{params[:country]}%").count > 0
                        @residences = Residence.where('description ILIKE ?', "%#{params[:country]}%")
                    else
                        @residences = Residence.all

INSERT INTO "residences" ("name", "location", "description", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @residence= Residence.new(residence_params)

        if @residence.save

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @residence = Residence.find(params[:id])

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        @residence = Residence.find(params[:id])

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "residences" SET "logic_delete" = $1, "updated_at" = $2 WHERE "residences"."id" = $3  [["logic_delete", "t"], ["updated_at", "2018-11-09 14:36:02.228252"], ["id", 6]]
DELETE FROM "residences" WHERE "residences"."id" = $1  [["id", 1]]
---
    def destroy
        @residence=Residence.find(params[:id])
        if @residence.reserved
            @residence.update(logic_delete: true)
            redirect_to residences_path, notice: 'Baja lógica correcta'
        elsif @residence.destroy