app/views/residences/home.html.erb

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <div class="carousel-item active">
              <img class="d-block w-100" src="<%= Residence.find(@hs.find(2).residence_id).image %>"  alt="First slide">